# Pandas -2

In [1]:
# Conditional Base Selection
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame(np.random.randn(5,4),index="A B C D E".split(),columns="W X Y Z".split())
df

          W         X         Y         Z
A -0.785890 -1.784911  2.068290 -1.854938
B -0.547070  0.119429  0.000331 -0.298657
C  0.243236  0.489157  0.432914  0.056920
D -1.197335 -0.223131 -0.598304 -0.316675
E  0.625390  0.632871 -0.089403  0.995327

In [5]:
# Conditions
df>0

       W      X      Y      Z
A  False  False   True  False
B  False   True   True  False
C   True   True   True   True
D  False  False  False  False
E   True   True  False   True

In [6]:
# Apply condition on only one variable
df["W"]>0

A    False
B    False
C     True
D    False
E     True
Name: W, dtype: bool

In [7]:
# Condition apply also with corresponding values

df[df["W"]>0]

          W         X         Y         Z
C  0.243236  0.489157  0.432914  0.056920
E  0.625390  0.632871 -0.089403  0.995327

In [8]:
# if want 1 variable from overall then

df[df["W"]>0]["Y"]

C    0.432914
E   -0.089403
Name: Y, dtype: float64

In [9]:
df[df["W"]>0][["Y","Z"]]

          Y         Z
C  0.432914  0.056920
E -0.089403  0.995327

In [10]:
#If apply on all values
df[df>0]

          W         X         Y         Z
A       NaN       NaN  2.068290       NaN
B       NaN  0.119429  0.000331       NaN
C  0.243236  0.489157  0.432914  0.056920
D       NaN       NaN       NaN       NaN
E  0.625390  0.632871       NaN  0.995327

In [13]:
# Another way apply only on W
df["W"][df["W"]>0]

C    0.243236
E    0.625390
Name: W, dtype: float64

In [14]:
a = df[df["X"]>0]
a

          W         X         Y         Z
B -0.547070  0.119429  0.000331 -0.298657
C  0.243236  0.489157  0.432914  0.056920
E  0.625390  0.632871 -0.089403  0.995327

In [15]:
a["Y"]

B    0.000331
C    0.432914
E   -0.089403
Name: Y, dtype: float64

In [17]:
# Another way
a = df[df["X"]>0]["Y"]
a

B    0.000331
C    0.432914
E   -0.089403
Name: Y, dtype: float64

In [18]:
# If there are two conditions then
df

          W         X         Y         Z
A -0.785890 -1.784911  2.068290 -1.854938
B -0.547070  0.119429  0.000331 -0.298657
C  0.243236  0.489157  0.432914  0.056920
D -1.197335 -0.223131 -0.598304 -0.316675
E  0.625390  0.632871 -0.089403  0.995327

In [19]:
# and operator
df[(df["X"]>0)&(df["Y"]>0)]

          W         X         Y         Z
B -0.547070  0.119429  0.000331 -0.298657
C  0.243236  0.489157  0.432914  0.056920

In [20]:
# or operator
df[(df["X"]>0)|(df["Y"]>0)]

          W         X         Y         Z
A -0.785890 -1.784911  2.068290 -1.854938
B -0.547070  0.119429  0.000331 -0.298657
C  0.243236  0.489157  0.432914  0.056920
E  0.625390  0.632871 -0.089403  0.995327

# Reset

In [21]:
df

          W         X         Y         Z
A -0.785890 -1.784911  2.068290 -1.854938
B -0.547070  0.119429  0.000331 -0.298657
C  0.243236  0.489157  0.432914  0.056920
D -1.197335 -0.223131 -0.598304 -0.316675
E  0.625390  0.632871 -0.089403  0.995327

In [22]:
# Use for new index
df.reset_index()

  index         W         X         Y         Z
0     A -0.785890 -1.784911  2.068290 -1.854938
1     B -0.547070  0.119429  0.000331 -0.298657
2     C  0.243236  0.489157  0.432914  0.056920
3     D -1.197335 -0.223131 -0.598304 -0.316675
4     E  0.625390  0.632871 -0.089403  0.995327

In [23]:
# minus values cant add in index
df["states"]=["CA","NY","WY","OR","CO"]
df

          W         X         Y         Z states
A -0.785890 -1.784911  2.068290 -1.854938     CA
B -0.547070  0.119429  0.000331 -0.298657     NY
C  0.243236  0.489157  0.432914  0.056920     WY
D -1.197335 -0.223131 -0.598304 -0.316675     OR
E  0.625390  0.632871 -0.089403  0.995327     CO

In [25]:
# Set the states in index
df.set_index("states")

               W         X         Y         Z
states
CA     -0.785890 -1.784911  2.068290 -1.854938
NY     -0.547070  0.119429  0.000331 -0.298657
WY      0.243236  0.489157  0.432914  0.056920
OR     -1.197335 -0.223131 -0.598304 -0.316675
CO      0.625390  0.632871 -0.089403  0.995327

In [27]:
df1=df.reset_index()
df1

  index         W         X         Y         Z states
0     A -0.785890 -1.784911  2.068290 -1.854938     CA
1     B -0.547070  0.119429  0.000331 -0.298657     NY
2     C  0.243236  0.489157  0.432914  0.056920     WY
3     D -1.197335 -0.223131 -0.598304 -0.316675     OR
4     E  0.625390  0.632871 -0.089403  0.995327     CO

In [29]:
df1.set_index("index")

              W         X         Y         Z states
index
A     -0.785890 -1.784911  2.068290 -1.854938     CA
B     -0.547070  0.119429  0.000331 -0.298657     NY
C      0.243236  0.489157  0.432914  0.056920     WY
D     -1.197335 -0.223131 -0.598304 -0.316675     OR
E      0.625390  0.632871 -0.089403  0.995327     CO

In [ ]:
# If want permanant changes then only add at the last of code "inplace = True"

# Operations on missing values

In [33]:
df = pd.DataFrame({"A":[1,2,np.nan],"B":[5,np.nan,np.nan],"C":[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [34]:
df.dropna() # here rowwise drop

     A    B  C
0  1.0  5.0  1

In [35]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [36]:
df.dropna(thresh=2) #minimum 2 values are present

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [37]:
df.dropna(thresh=2,axis=1)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [38]:
df.dropna(thresh=1,axis=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [39]:
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [40]:
df.fillna(df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [41]:
df.fillna(100)

       A      B  C
0    1.0    5.0  1
1    2.0  100.0  2
2  100.0  100.0  3

In [42]:
# Add 100 only in A
df["A"].fillna(100)

0      1.0
1      2.0
2    100.0
Name: A, dtype: float64

In [43]:
df["A"]=df["A"].fillna(100)
df

       A    B  C
0    1.0  5.0  1
1    2.0  NaN  2
2  100.0  NaN  3